/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 1. 项目名称：www.guanaihui.com
 2. 页面名称：productDetail(产品详情)
 3. 作者：尹芹(yinqin@guanaihui.com)
 4. 备注：
 -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
function DetailController() {
    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
     继承于Controller基类
     -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    Controller.call(this);
    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    页面顶部全部服务分类下拉
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    this.servicesCategory();
    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    下拉框选择门店
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    this.chooseStore();
    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    显示更多
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    this.showMore();
    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    显示产品fixed
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    this.showProduct();
    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    点击立即预约事件
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    this.showReserveModual();

    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    回到页面顶部以及在线咨询两个按钮的浮动条   
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    this.floater();
    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    top 栏
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    this.ajaxSet();
    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    选择时间段事件
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    this.selTime();
}
/*top栏获取一些东西*/
DetailController.prototype.ajaxSet=function(){
    $.ajaxSetup ({ 
        cache: false 
    });
    $(".topper-service").load('/personal/toper/count', function(data){
    });
}
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 下拉框选择门店
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
DetailController.prototype.chooseStore = function() {
    var _this = this;
    $("#shopSelector").find(".dropdown-menu li").click(function(){
        $("#shopSelector").find(".dropdown-menu li").removeAttr("data-selected");
        $(this).attr("data-selected","selected");
        $(this).trigger("change");
    });
    $("#shopSelector").find(".dropdown-menu li").bind("change",function(){
        var $selectedOption = $("#shopSelector").find(".dropdown-menu li[data-selected='selected']");
        var shopName = $selectedOption.children("a").text();
        var shopId = $selectedOption.attr("data-id");
        var address = $selectedOption.attr("data-address");
        var time = $selectedOption.attr("data-time");
        // 填充选择的名称
        $("#shopSelector .j-shop-name").text(shopName);
        // 填充门店ID
        $("#storeId").val(shopId);
        // 填充门店地址
        $(".description .addr").text(address);
        // 填充门店营业时间
        $(".description .store-time").text(time);
        // 更改预约链接
        $(".btn-reserve").attr("data-reserve", "/product/booking/dialog?pid=" + $("#productId").val() + "&sId=" + shopId +"&origin="+$('#origin').val());
    });
    $("#shopSelector").find(".dropdown-menu li[data-selected='selected']").trigger("change");
};

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 显示更多
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
DetailController.prototype.showMore = function() {
    if ($("#showMore").size() === 0) return;
    $("#showMore").click(function() {
        var _this = $(this);
        _this.find("i").hasClass("icon-xiangxia2") ? _this.html("收起<i class='iconfont icon-xiangshang3'></i>") : _this.html("更多机构门店 <i class='iconfont icon-xiangxia2'></i>");
        _this.find("i").hasClass("icon-xiangxia2") ? _this.siblings(".more-item").slideUp() : _this.siblings(".more-item").slideDown();
    });
};

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 显示产品fixed
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
DetailController.prototype.showProduct = function() {
    $(window).scroll(function() {
        var $_suitStore = 540;
        $_windowScroll = $(window).scrollTop();
        $_windowScroll >= 540 ? $(".product-fixed").show() : $(".product-fixed").hide();
    });
};
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 点击立即预约事件
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
DetailController.prototype.showReserveModual = function() {
    var _this = this;
    require([
        _this.utilStaticPrefix + '/Datejs/build/date.min.js',
        _this.appStaticPrefix + '/components/reserve.min.js',
        _this.appStaticPrefix + '/account/login.min.js',
        _this.appStaticPrefix + '/account/register.min.js'
    ], function() {
        $(".btn-reserve").click(function() {
            var $_this = $(this);
            var data = {};
            var param = {
                // 成功调用预约接口回掉
                process: function(data) {
                    if (parseInt(data.result) === 0) {
                        ////////////////////////没有登录,弹出登录框///////////////////
                        _this.popUpAccoountModule();
                    } else {
                        ////////////////////////已经登陆，直接弹出预约框///////////////////
                        _this.popUpReserveModule();
                    }
                },
                onExceptionInterface: function(code, messgae) {

                }
            };
            _this.request(_this.checkLoginApiUrl, data, param);

            // GA监测
            ga('send', 'event', 'specialck', 'appointment', '预约专项检查', parseInt($("#productId").val()));  
        });
    });
};
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 弹出预约模态框
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
DetailController.prototype.popUpReserveModule = function() {
    var _this = this;
    _this.dialog({
        "tabindex": 1,
        "id": "module-reserve",
        "effect": false,
        "url": $(".btn-reserve").attr("data-reserve")
    });
    $('#module-reserve').on('loaded.bs.modal', function(e) {
        new Reserve(_this);
    });
};
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 弹出登录注册模态框
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
DetailController.prototype.popUpAccoountModule = function() {
    var _this = this;
    _this.dialog({
        "tabindex": 2,
        "id": "module-account",
        "effect": false,
        "url": $(".btn-reserve").attr("data-account")
    });
    $('#module-account').on('loaded.bs.modal', function(e) {
        _this.swapTabs();
        new LoginController({
            "successCallback": _this.accountCallback,
            "successHandler": _this
        });
        new RegisterController({
            "successCallback": _this.accountCallback,
            "successHandler": _this
        });
    });
};
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 登录注册成功之后的回调函数
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
DetailController.prototype.accountCallback = function(user, successHandler) {
    var _this = successHandler,
        userName = user.name.length === 0 ? user.mobile : user.name;
    $(".toper .pull-right a").remove();
    var content = '<a id="userBox" href="javascript:;" >\
        <i class="icon-bg-manage icon-toper-user"></i>\
        <span>'+userName+'</span>\
        <i class="icon-bg-manage icon-toper-arrow-down"></i>\
        </a>\
        <a id="msgBox" href="/personal/news">\
        <i class="icon-bg-manage icon-toper-msg"></i>\
        </a>\
        <a id="logout" href="/logout">退出</a>\
        <ul class="hide">\
        <li><a href="/personal/booking/spec">专项检查预约</a></li>\
        <li><a href="/personal/booking/chk">体检预约</a></li>\
        <li><a href="/personal">个人中心</a></li>\
        <li><a href="/personal/giftcard">绑定礼品卡</a></li>\
        </ul>';
    $(".toper .pull-right").append(content);
    $('#module-account').modal('hide');
    _this.popUpReserveModule();
};
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 时间段选择
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
DetailController.prototype.selTime=function(){
    $('body').on('change','#sel',function(){
        $('#bookingEndTime').val($(this).children('option:selected').html());
    })
    $('body').on('click', '.backDate', function(event) {
        $('#datepicker h4,#datepicker select').hide();
        $('#datepicker .datepicker-inline').show();
        $('#module-reserve .date #datepicker').css('padding','0 30px 10px');
        $('#datepicker').css('width','300px');
        $('.date h3').html('选择日期');
    });
}

$(document).ready(function() {
    new DetailController;
});