/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 1. 项目名称：www.guanaihui.com
 2. 页面名称：productDetail(产品详情)
 3. 作者：尹芹(yinqin@guanaihui.com)
 4. 备注：
 -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
function DetailController() {
    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
     继承于Controller基类
     -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    Controller.call(this);
    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    页面顶部全部服务分类下拉
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    this.servicesCategory();
    // -----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    // 下拉框选择门店
    // -----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    // this.chooseStore();
    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    显示更多
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    this.showMore();
    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    显示产品fixed
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    this.showProduct();
    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    点击立即预约事件
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    this.showReserveModual();

    /*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    回到页面顶部以及在线咨询两个按钮的浮动条   
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
    this.floater();
};

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 下拉框选择门店
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
// DetailController.prototype.chooseStore = function() {
//     var _this = this;
//     if ($(".description select").size() === 0) return;
//     $(".description select").change(function() {
//         var $_this = $(this);
//         var $selOption = $_this.find("option:selected");
//         $(".description .addr").text($selOption.attr("data-address"));
//         $(".description .store-time").text($selOption.attr("data-time"));
//         $(".btn-reserve").attr("data-reserve", "/product/booking/dialog?pid=" + $("#productId").val() + "&sid=" + $selOption.attr("data-id"));
        
//         var $_this = $(this),
//             storeId = $_this.find("option:selected").attr("data-id");
//         $("#storeId").val(storeId);
//         var data = {
//             "storeId": storeId
//         };
//         var param = {
//             // 成功调用预约接口回掉
//             process: function(data) {
//                 //这里去根据门店改变地址和营业时间   #tag
//                 $(".description .addr").text();
//                 $(".description .store-time").text();
//             },
//             onExceptionInterface: function(code, messgae) {

//             }
//         };
//         _this.request(_this.getStoreInfoByIdApiUrl, data, param);
        
//     });
// };

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 显示更多
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
DetailController.prototype.showMore = function() {
    if ($("#showmorestores").size() != 0)
    {
        $("#showmorestores").click(function() {
            var _this = $(this);
            _this.find("i").hasClass("icon-xiangxia2") ? _this.html("收起<i class='iconfont icon-xiangshang3'></i>") : _this.html("更多机构门店 <i class='iconfont icon-xiangxia2'></i>");
            _this.find("i").hasClass("icon-xiangxia2") ? _this.siblings(".more-item").slideUp() : _this.siblings(".more-item").slideDown();
            if(_this.find("i").hasClass("icon-xiangxia2") == true)
              $("html,body").scrollTop($("div.stores").offset().top-160);
        });
    }
    if ($("#showmoreitems").size() != 0)
    {
        $("#showmoreitems").click(function() {
            var _this = $(this);
            _this.find("i").hasClass("icon-xiangxia2") ? _this.html("收起<i class='iconfont icon-xiangshang3'></i>") : _this.html("更多套餐项目 <i class='iconfont icon-xiangxia2'></i>");
            _this.find("i").hasClass("icon-xiangxia2") ? _this.siblings(".more-item").slideUp("slow") : _this.siblings(".more-item").slideDown();
            if(_this.find("i").hasClass("icon-xiangxia2") == true)
              $("html,body").scrollTop($("#itemtitle").offset().top-130);
            filteritemdata();
        });

    }
    
};

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 显示产品fixed
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
DetailController.prototype.showProduct = function() {
    $(window).scroll(function() {
        var $_suitStore = 540;
        $_windowScroll = $(window).scrollTop();
        $_windowScroll >= 540 ? $(".product-fixed").show() : $(".product-fixed").hide();
    });
};
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 点击立即预约事件
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
DetailController.prototype.showReserveModual = function() {
    var _this = this;
    require([
        _this.utilStaticPrefix + '/Datejs/build/date.min.js',
        //_this.appStaticPrefix + '/components/reserve.min.js',
        _this.staticDomain + '/apps/www.guanaihui.com/jssrc/components/reserve.js',
        _this.appStaticPrefix + '/account/login.min.js',
        _this.appStaticPrefix + '/account/register.min.js'
    ], function() {
        $(".btn-reserve").click(function() {
            var $_this = $(this);
            var data = {};
            var param = {
                // 成功调用预约接口回掉
                process: function(data) {
                    if (parseInt(data.result) === 0) {
                        ////////////////////////没有登录,弹出登录框///////////////////
                        _this.popUpAccoountModule();
                    } else {
                        ////////////////////////已经登陆，直接弹出预约框///////////////////
                        _this.popUpReserveModule();
                    }
                },
                onExceptionInterface: function(code, messgae) {

                }
            };
            _this.request(_this.checkLoginApiUrl, data, param);
        });
    });
};
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 弹出预约模态框
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
DetailController.prototype.popUpReserveModule = function() {
    var _this = this;
    _this.dialog({
        "tabindex": 1,
        "id": "module-reserve",
        "effect": false,
        "url": $(".btn-reserve").attr("data-reserve")
    });
    $('#module-reserve').on('loaded.bs.modal', function(e) {
        new Reserve(_this);
    });
};
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 弹出登录注册模态框
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
DetailController.prototype.popUpAccoountModule = function() {
    var _this = this;
    _this.dialog({
        "tabindex": 2,
        "id": "module-account",
        "effect": false,
        "url": $(".btn-reserve").attr("data-account")
    });
    $('#module-account').on('loaded.bs.modal', function(e) {
        _this.swapTabs();
        new LoginController({
            "successCallback": _this.accountCallback,
            "successHandler": _this
        });
        new RegisterController({
            "successCallback": _this.accountCallback,
            "successHandler": _this
        });
    });
};
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 登录注册成功之后的回调函数
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
DetailController.prototype.accountCallback = function(user, successHandler) {
    var _this = successHandler,
        userName = user.name.length === 0 ? user.mobile : user.name;
    $(".toper .pull-right a").remove();
    $(".toper .pull-right").append("<a href='/user'>" + userName + "</a><a href='/logout'>退出</a><a href='/user'>会员中心</a>");
    $('#module-account').modal('hide');
    _this.popUpReserveModule();
};
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
 类的初始化
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
$(document).ready(function() {
    new DetailController;
});
